In [7]:
import pandas as pd

In [13]:
cols = ['user_id','age','gender', 'occupation', 'postal_code']
frame = pd.read_table('resources/u.user', sep='|', header=None,  names=cols)

     user_id  age gender     occupation postal_code
0          1   24      M     technician       85711
1          2   53      F          other       94043
2          3   23      M         writer       32067
3          4   24      M     technician       43537
4          5   33      F          other       15213
..       ...  ...    ...            ...         ...
938      939   26      F        student       33319
939      940   32      M  administrator       02215
940      941   20      M        student       97229
941      942   48      F      librarian       78209
942      943   22      M        student       77841

[943 rows x 5 columns]

In [14]:
frame.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [15]:
frame.dtypes

user_id         int64
age             int64
gender         object
occupation     object
postal_code    object
dtype: object

In [16]:
frame.describe(include=['object'])

       gender occupation postal_code
count     943        943         943
unique      2         21         795
top         M    student       55414
freq      670        196           9

In [22]:

frame.rename(columns={"postal_code":"zip_code"}, inplace=True)

In [23]:
frame

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [24]:
frame.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [27]:
frame.columns = frame.columns.str.replace('_', '-')

In [28]:
frame.columns

Index(['user-id', 'age', 'gender', 'occupation', 'zip-code'], dtype='object')

In [29]:
frame2 = frame

In [31]:
frame2.drop(['zip-code'], axis=1)

     user-id  age gender     occupation
0          1   24      M     technician
1          2   53      F          other
2          3   23      M         writer
3          4   24      M     technician
4          5   33      F          other
..       ...  ...    ...            ...
938      939   26      F        student
939      940   32      M  administrator
940      941   20      M        student
941      942   48      F      librarian
942      943   22      M        student

[943 rows x 4 columns]

In [39]:
frame2.drop(frame2.index[10:21], axis=0)

     user-id  age gender     occupation zip-code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[932 rows x 5 columns]